


word_variable = {
    "name" : "variable",
    "russian" : "Переменная",
    "decription" : " Данные или значение , которые переменная хранить в определенный момент времени в программе" ,
}

word_function = {
    "name" : "function",
    "russian" : "функция",
    "decription" : "Блок кода выполняющий определенные задачи. функция может принимать данных, обрабатывать их , возращать результат" ,
}

word_loop = {
    "name" : "loop",
    "russian" : "цикл",
    "decription" : "Конструкция позволяющая выполнить один или несколько блоков кода многократно" ,
}

word_array = {
    "name" : "array",
    "russian" : "массив",
    "decription" : "упорядоченная коллекция элементов, доступ к которым осуществяляется по индексу" ,
}

word_class = {
    "name" : "class",
    "russian" : "клас",
    "decription" : "Шаблон для создания обьектов определяющие их свойства и методы" ,
}

word_object = {
    "name" : "object",
    "russian" : "обьект",
    "decription" : "Экземпляр класса , содержащий конеретные данные и методы для их обработки" ,
}

word_method = {
    "name" : "method",
    "russian" : "метод",
    "decription" : "функуия привязанная к обьекту или классу , обрабатывающая данные обьекта" ,
}

word_condition = {
    "name" : "condition",
    "russian" : "условие",
    "decription" : "Часть программы , которая определяет, какой код должен быть выполнен в зависимости от истиности выражения" ,
}

word_statment = {
    "name" : "statment",
    "russian" : "Инструкция",
    "decription" : "Строка кода, выполняющая определенные действия" ,
}

word_parametr = {
    "name" : "parametr",
    "russian" : "параметр",
    "decription" : "Значение передаваемое в функцию при ее вызове, для использования внутри функции" ,
}